{"inkVersion":11,"root":[{"->":"clock_tower"},"done",{"clock_tower":[["^BACKGROUND clockTowerOutside","\n","^You approach the tall tower. It's tall. It's a tower. Hold on. I forgot clock.","\n","^Clock tower. The tall clock tower. Tall, towering, and clocky.","\n","^Nice.","\n",["ev","str","^Jump","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You try to jump onto the roof, but only make it a foot (30.48cm) off the ground. I don't know why you bothered trying. So you just walk in through the door.","\n","\n",{"->":".^.^.^.^.clock_interior"},{"#f":7}]}],["ev","str","^Use the door","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You grip the doorknob firmly in your hand and turn it. You push against the door. But nothing happens.","\n","\n","^You try pulling the door. Something happens. Shock horror: the door opens! Who would've believed it, eh? You skulk inside like a typoed skunk. ",{"->":".^.^.^.^.clock_interior"},"\n",{"#f":7}]}],null],{"clock_interior":[["^It's pretty dark inside, but you can see there's nothing of interest on the ground floor so you head up the wooden set of stairs.","\n","^BACKGROUND door","\n","^At the top is a door, a beam of light shines through a keyhole, and - under the sound of a machine humming - you can hear someone scrabbling around in the room beyond.","\n",["ev","str","^Try the door","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You turn the handle of the door but it won't budge, no matter which way you try. This door is locked.","\n","\n",{"->":".^.^.^.^.^.danae_talk1"},{"#f":7}]}],["ev","str","^\"Hello? Anyone in there?\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: Hello? Anyone in there? ",{"->":".^.^.^.^.^.danae_talk1"},"\n",{"#f":7}]}],null],{"#f":3}],"danae_talk1":[["^The scrabbling sound comes closer to the door and the thin light is extinguished.","\n","^Danae: Hello? Can you hear me? I've been locked in","\n",["ev","str","^\"What happened?\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: What happened?","\n","^Danae: That doesn't matter right now. Just - please - you've gotta get me out. I've been in here all day","\n",{"->":".^.^.^.^.^.but_why"},{"#f":7}]}],["ev","str","^\"Stand back!\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: Stand back! I've got a plan","\n",{"->":".^.^.^.^.^.a_plan"},{"#f":7}]}],null],{"#f":3}],"but_why":[[["ev","str","^\"Not until you tell me why\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: Not until you tell me why you've been locked away. You could be an escaped convict","\n","^Really? Is that the best you could come up with? That's so cliche. I'm going to punish that lack of originality by having Danae ignore your latest comment.","\n","^So... erm. How can I get this back on track?","\n","^I know...","\n","^Danae: Please help me!","\n","^Zeus: OK. Stand back! I've got a plan","\n",{"->":".^.^.^.^.^.a_plan"},{"#f":7}]}],["ev","str","^\"Stand back\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: Stand back! I've got a plan","\n",{"->":".^.^.^.^.^.a_plan"},{"#f":7}]}],null],{"#f":3}],"a_plan":[["^Come on then, hot shot. What's the plan?","\n",["ev","str","^Yell for help","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You start yelling at the top of your voice.","\n","\n","^Zeus: Heeeelp! Heeeelllp! Helepelepeepepep! He-","\n","^Danae: Would you shut up! Don't you think I might have already tried that?","\n","^Zeus: I suppose you might. OK, new plan","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Ask Danae where the key is","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: Do you have the key?","\n","^Danae: If I had the key would I still be in here?","\n","^Zeus: M-maybe","\n","^Danae: No, no I wouldn't. If you don't do something soon I'll wet myself","\n","^Zeus: I better think quickly","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Shapeshift","/str","/ev",{"*":".^.c","flg":20},{"c":["^ Oh, this might actually work. Go on then.","\n","\n",{"->":".^.^.^.^.^.shapeshift_danae"},{"#f":7}]}],null],{"#f":3}],"shapeshift_danae":[["^What will you shapeshift into?","\n",["ev","str","^Lightning","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You decide to become Lightning.","\n","\n","^Zeus: Remain standing back!","\n","^Your skin frizzles with electric energy. Wham! You're a lightning bolt.","\n","^Lightning: I hadn't thought this through!","\n","^You earth to the nearest metal object: the door handle. It promptly melts leaving a red hot lump that's no use to anyone anymore. Good work.","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Cloud","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: OK, you don't need to be as standing back now. I don't think even I could hurt you while being a soft billowy cloud.","\n","^Danae: You what?","\n","^Zeus: Oh, forget it.","\n","^Puff! You're a cloud.","\n",{"->":".^.^.^.^.^.cloud_danae"},{"#f":7}]}],["ev","str","^Bull","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You will take on the form of a bull.","\n","\n","^This could be fun. Let me just get some popcorn.","\n","^...","\n","^OK.","\n","^Zeus: Could you please go as far back and remain as un-matador-like as you can?","\n","^Danae: I don't like the sound of this.","\n","^Ignore her. This is the best idea ever.","\n","^Flink! You're a bull. The wooden landing below you creaks with the sudden weight of your bulk.","\n",{"->":".^.^.^.^.^.bull_landing"},{"#f":7}]}],["ev","str","^Light","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You're gonna give this Light thing a try.","\n","\n","^Zeus: Stand back. Unless you like being tanned.","\n","^Zeus: That might be how this works, I'm not really sure.","\n","^Zeus: Anyway. Stand back. Away from the door.","\n","^Danae: *mumble mumble*","\n","^Zeus: What? I didn't hear you cos","\n","^Light: I just changed into a shower of gold light *sparkle sparkle*","\n","^Danae: R-right. Anyway. If you could go and get me some help that would be great. Emphasis on 'go'.","\n",{"->":".^.^.^.^.^.light_danae"},{"#f":7}]}],null],{"#f":3}],"cloud_danae":[[["ev","str","^Float on through the keyhole","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You can certainly squeeze your molecules together to fit through the hole, but there's something pushing against you.","\n","\n","^Cloud: Wind! My greatest enemy. And also ally. Actually, I'm kinda lukewarm to wind, if I'm honest.","\n","^There's a strong air current blocking your passage through the keyhole. Well that sucks. Or blows, amirite?","\n","^Cloud: I might as well change back.","\n","^Danae: What did you say?","\n","^Zeus: Nothing.","\n",{"->":".^.^.^.^.^.shapeshift_danae"},{"#f":7}]}],null],{"#f":3}],"bull_landing":[["^You eye up the door, readying to charge it.","\n",["ev","str","^Charge","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You put one hoof forward, the wood underneath splinters and you trip, hitting your head against the door. You've left a small scratch in the wood, but otherwise the door is still as solid as before.","\n","\n","^Bull: Um... That was a practise run.","\n","^Danae: You're practising knocking on the door? How's that going to help?","\n","^Bull: I thought your imprisonment might be psychosomatic.","\n","^Danae: Don't be ridiculous. Just open the door!","\n","^Bull: I'll need to think of something else.","\n","^Danae: Too right!","\n","^Zeus: Leave it to me.","\n","^Danae: If only I had any other option.","\n",{"->":".^.^.^.^.^.shapeshift_danae"},{"#f":7}]}],null],{"#f":3}],"light_danae":[["^Light: Hey. Don't be like that *sparkle sparkle*","\n","^Danae: Why do you keep saying 'sparkle sparkle' after every sentence?","\n","^Light: It's endearing *sparkle sparkle*","\n","^Danae: I'll be the judge of that","\n","^Light: And...? *sparkle sparkle*","\n","^Danae: It might be growing on me.","\n","^Light: *sparkl-","\n","^Danae: Growing on my nerves! Would you stop that and just do some rescuing? Please. I really need a wee.","\n",["ev","str","^Zip through the keyhole","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You bundle your photons together and point a ray through the keyhole.","\n","\n","^Before you know it, you're on the other side. ",{"->":".^.^.^.^.^.in_clock"},"\n",{"#f":7}]}],["ev","str","^Just stay where I am, thanks","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You remain in place. As much as a wild bundle of particles can remain in one place, anyway.","\n","\n","^In fact, anyone with a passing interest in particle physics will know how particles can suddenly be somewhere else entirely.","\n","^And lo and behold, wouldn't you know it, at this very instant all of your particles have shifted over to the other side of the door. What are the chances? ",{"->":".^.^.^.^.^.in_clock"},"\n",{"#f":7}]}],null],{"#f":3}],"in_clock":[["^BACKGROUND clockTowerInside","\n","^Finally inside the inner workings of the clock tower, you can see Danae for the first time. Unfortunately the moment is slightly ruined by the mass of dead birds covering the floor.","\n","^Danae: I-is that you?","\n","^Light: Of course. My name's Zeus, what's yours?","\n","^Danae: Danae","\n","^Light: You don't know what your own name is?","\n","^Danae: Don't be daft. So now you're in here, how are we going to get out?","\n",["ev","str","^\"Oh yeah\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Light: Oh yeah, that's a really good point. Ermm...","\n",{"->":".^.^.^.^.^.plan_to_leave"},{"#f":7}]}],["ev","str","^\"What's the rush?\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Light: What's the rush? I've got all the time in the world... for you.","\n","^Danae: Well I've got a bladder that's about to burst so if you could just think of a way to help me rather than get in my knickers (which will very soon be very much wetter), I'd appreciate it.","\n",{"->":".^.^.^.^.^.plan_to_leave"},{"#f":7}]}],["ev","str","^\"Wait, what about the birds?\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Light: Wait, what's going on with these dead birds?","\n","^Danae: Look, we can talk about anything you like once we're out of here. Right now, my top priority is escaping this place.","\n",{"->":".^.^.^.^.^.plan_to_leave"},{"#f":7}]}],null],{"#f":3}],"plan_to_leave":[["^Light: OK. So what have we got here? Loads of dead birds, an idustrial size fan pointing at the door.","\n","^Light: Why is there an industrial size fan pointing at the door?","\n","^Danae: To keep the poison out.","\n","^Light: Huh?","\n","^Danae: I'm fumigating the clock tower, and that fan is keeping the fumes out.","\n","^Light: So that's why there's all these dead birds?","\n","^Danae: Or 'pests'. Yep.","\n","^Light: Couldn't there have been another way?","\n","^Danae: Well, I could have elecrocuted them. That's always fun to watch.","\n","^Light: Not what I meant.","\n","^Danae: I know.","\n","^Light: There's an open panel up there","\n","^Danae: I've climbed up and had a look. It's no good, there's a shear drop outside.","\n","^Danae: Maybe if it was on the other side I could dive into the river, but sadly it's hard ground below.","\n","^Light: Hey","\n","^Zeus: I think I've got a plan.","\n","^Danae: Oh, is that what you really look like?","\n","^Zeus: Kinda. Do you like it?","\n","^Danae: I prefer the sparkling golden lights look, myself.","\n","^Zeus: Well that's good, because that light show made you pregnant.","\n","^Danae: You what?","\n","^Zeus: You know when I said to move back? There was a very good reason.","\n","^Zeus: You didn't move back quite far enough and now you've got a pigeon in the coop.","\n","^Danae: ...","\n","^Danae: I can't deal with this now. Just tell me what your plan is.","\n","^Zeus: Why tell you when I can show you?","\n",["ev","str","^Pick up dead birds","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You scoop up a bundle of birds, the individual creatures lost in a mass of feathers, claws, and beaks. You start to juggle with them. Danae looks on, unimpressed. You drop the birds. Maybe you should try shapeshifting?","\n","\n",{"->":".^.^.^.^.^.shapeshift_interior"},{"#f":7}]}],["ev","str","^It's shapeshiftin' time","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":".^.^.^.^.^.shapeshift_interior"},{"#f":7}]}],["ev","str","^Fiddle with fan","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You try to haul the large fan around, but it's too heavy. Maybe if you were to shapeshift?","\n","\n",{"->":".^.^.^.^.^.shapeshift_interior"},{"#f":7}]}],null],{"#f":3}],"shapeshift_interior":[["^What will you shapeshift into?","\n",["ev","str","^Lightning","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: Keep well clear and make sure you're not touching anything metal.","\n","^Danae: Er... OK.","\n","^CHOOM! You're lightning, you are.","\n",{"->":".^.^.^.^.^.lightning_interior"},{"#f":7}]}],["ev","str","^Cloud","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You foof into a cloud and are immediately sucked into the fan. After spinning you around a couple of times, it spits you out and the wind forces you back out through the keyhole.","\n","\n","^BACKGROUND door","\n","^Once again on the wrong side of the door, you shapeshift into light to get back to Danae.","\n","^BACKGROUND clockTowerInside","\n","^Zeus: That didn't go as I expected. Maybe if I try...","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Bull","/str","/ev",{"*":".^.c","flg":20},{"c":["^ Your muscles ripple and alter as you become the bull. You dip your head, aiming for the door. You scrape a hoof along the floor.","\n","\n","^You're ready to charge.","\n","^Forward you go, speeding through the room, keeping the door in your sights. But your horns get tangled in the fan. You try to shake free, but only succeed in moving the fan around. It blows feathers about the room. You disentangle yourself from the fan, which settles back into its original position.","\n","^Bull: Hmmm...","\n","^Zeus: That wasn't quite right.","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Light","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You become a shower of light again.","\n","\n","^Danae: How is this different to how you just were?","\n","^Light: It isn't.","\n","^Zeus: Let me try something else...","\n",{"->":".^.^.^.^"},{"#f":7}]}],null],{"#f":3}],"lightning_interior":[[["ev","str","^Touch the fan","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You reach out to the fan. At your touch, it sparks and speeds up, the whirring becoming louder. But that's all. You retract your touch and it settles back to its usual speed. You inadvertently brush against a pigeon.","\n","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Touch a bird","/str","/ev",{"*":".^.c","flg":20},{"c":["^ Your spark touches the dead bird, sending electricity shooting through all those in contact. Their little bodies explode in a cloud of feathers.","\n","\n","^Lightning: That was awesome!","\n","^Danae: What'd I tell you? Electrocution's the way to go with birds.","\n","^As the feathers settle onto the floor, you transform back.","\n","^Zeus: Now for the next stage of my plan.","\n","^Danae: You're not going to change into something again are you?","\n","^Zeus: As a matter of fact, I am.","\n",{"->":".^.^.^.^.^.next_stage"},{"#f":7}]}],null],{"#f":3}],"next_stage":[["^What will you shapeshift into?","\n",["ev","str","^Lightning","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You crackle into a bolt of lightning and touch another of the birds, but it's no good. They're all de-feathered. And trying to Frankenstein them simply won't work. You'll have to use a different form.","\n","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Cloud","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You shoomf into a cloud and are immediately sucked into the fan and out through the keyhole.","\n","\n","^BACKGROUND door","\n","^You pulse into lightning to get back into the feather-floored room.","\n","^BACKGROUND clockTowerInside","\n","^Another angle will have to be considered.","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Bull","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You growl into a bull.","\n","\n",{"->":".^.^.^.^.^.bull_interior"},{"#f":7}]}],["ev","str","^Light","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You shimmer into light. You feel very sparkly but ultimately useless in the current situation. Maybe choose a different form.","\n","\n",{"->":".^.^.^.^"},{"#f":7}]}],null],{"#f":3}],"bull_interior":[["^What will you do now?","\n",["ev","str","^Charge at the door","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You charge head-first at the door but the fan is in the way.","\n","\n",{"->":".^.^.^.^.^.bull_fan"},{"#f":7}]}],["ev","str","^Charge at the fan","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You barrel towards the fan.","\n","\n",{"->":".^.^.^.^.^.bull_fan"},{"#f":7}]}],["ev","str","^Charge at the clock mechanism","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You target a part of the clock's workings and rush towards it. Slipping on a bank of feathers however, you barrel into the fan.","\n","\n",{"->":".^.^.^.^.^.bull_fan"},{"#f":7}]}],null],{"#f":3}],"bull_fan":[["^Catching your horns in its frame, you wrench the fan round and see that its blast of air has made the carpet of bird feathers rise up off the floor.","\n","^Bull: Hmmm... aerodynamics, angle of trajectory, air density. I think I can make this work.","\n","^Danae: This looks pretty cool, but how is it helping us get out of here?","\n","^Bull: If my calculations are correct, we'll be able to escape in no time.","\n",{"->":".^.^.^.aiming_fan"},null],{"#f":3}],"aiming_fan":[["^Aim that fan at something.","\n",["ev","str","^Danae","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You point the fan towards Danae and she's soon covered head to toe in feathers.","\n","\n","^Danae: If you don't get these things off me in ten seconds, I'm going to shove each and every one of these birds int-","\n","^You angle the fan to get the feathers away from Danae.","\n","^Danae: I should think so. Let's not do that again, OK?","\n","^Bull: Hold on. Look! The feathers are going out of that panel and falling to the ground outside.","\n",{"->":".^.^.^.^.^.feathers_falling"},{"#f":7}]}],["ev","str","^The open panel","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You angle the fan to shoot the feathers out of the open panel.","\n","\n","^Bull: The feathers are dropping onto the ground outside.","\n",{"->":".^.^.^.^.^.feathers_falling"},{"#f":7}]}],["ev","str","^The door","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You point the fan back at the door.","\n","\n","^Danae: How is that supposed to help? That's how the fan was before.","\n","^Bull: Yes, but this time I'm holding it.","\n","^Danae: And...? Look, how about if you shoot the feathers out of that open panel up there?","\n","^Bull: What an intriguing proposition.","\n","^You angle the fan to do just that, watching feathers fly out and fall to the ground outside.","\n",{"->":".^.^.^.^.^.feathers_falling"},{"#f":7}]}],null],{"#f":3}],"feathers_falling":[["^You let the last few feathers fall to the floor before releasing the fan.","\n","^Bull: That should give us a sufficiently cushioned landing to prevent injury.","\n","^Danae: Thank you. I can finally get out of here.","\n",["ev","str","^\"What's the hurry?\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: What's the hurry? I was just getting to know you.","\n","^Danae: Well, I did kinda like you when you were that shower of gold light.","\n","^Zeus: It's the *sparkle sparkle* isn't it?","\n","^Danae: That was quite cute, I suppose. But I really need to use the toilet.","\n","^Zeus: Hey, that's OK; I like golden showers too!","\n","^Oh no. Was that too much? I think that was too much.","\n","^I think I'll draw a veil across this scene.","\n","^BACKGROUND clockTowerOutside","\n","^You and Danae emerge from the open panel in the clock tower, each having had relief.","\n",{"->":".^.^.^.^.^.danae_end"},{"#f":7}]}],["ev","str","^\"Yeah, let's go\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: Yeah, let's go. It's getting kinda stuffy in here.","\n","^You and Danae climb up to the open panel and dangle your feet over the edge.","\n","^BACKGROUND clockTowerOutside","\n",{"->":".^.^.^.^.^.danae_end"},{"#f":7}]}],null],{"#f":3}],"danae_end":[["^Danae: Wheeee!","\n","^Danae lands in the middle of the pile of feathers that's built up at the base of the clock tower.","\n","^Danae: That was great. Come on down.","\n","^Zeus: Just coming. Yaaaah!","\n","^You settle amongst the feathers beside her.","\n","^Zeus: Hey, these feathers are pretty handy. That gives me a super duper idea.","\n","^Zeus: Wubadubbadubbaah!","\n","^NEW TRANSFORMATION ACQUIRED. You are now able to shapeshift into the form of a bird!","\n","^You can choose from any of the birds of the world","\n","^to be a swan, an eagle, or a cuckoo.","\n","^I know it seems a strangely arbritrary selection while also being oddly specific, but that's simply the nature of your awesome powers. It's not up to me.","\n",["ev","str","^I choose Swan","/str","/ev",{"*":".^.c","flg":20},{"c":["^Swan: This reminds me of when I went on a bender and accidentally turned into a giraffe. Animals with long necks are so hard to handle.","\n",{"->":".^.^.^.^.^.danae_bye"},{"#f":7}]}],["ev","str","^I choose Eagle","/str","/ev",{"*":".^.c","flg":20},{"c":["^Eagle: I feel elated! Delighted! I'm so happy with my lot in life.","\n","^Danae: Well you look exceedingly angry.","\n","^Eagle: Oh really? How about if I do this?","\n","^Eagle: Hmmm?","\n","^Danae: Still angry.","\n","^Eagle: Aww man.","\n",{"->":".^.^.^.^.^.danae_bye"},{"#f":7}]}],["ev","str","^I choose Cuckoo","/str","/ev",{"*":".^.c","flg":20},{"c":["^Cuckoo: Hmmm. I don't have much to say. Except this is the BEST DECISION I'VE EVER MADE!!!","\n",{"->":".^.^.^.^.^.danae_bye"},{"#f":7}]}],null],{"#f":3}],"danae_bye":[["^You flap your wings to test them, and are suddenly launched into the air. This will take some getting used to.","\n","^Danae: Wait, I haven't told you why I was locked in a room with an industrial fan! You see, I was just getting my...","\n","^But you're too far away to hear the rest. Oh well, I'm sure it was unimportant but completely logical.","\n","^You fly back to campus, and turn back into human form once you've landed.","\n","end",null],{"#f":3}],"#f":3}],"#f":3}]}