{"inkVersion":11,"root":[{"->":"playing_fields"},"done",{"playing_fields":[["^BACKGROUND outdoor","\n","^You mooch on over to the playing fields, the sound of a cheering crowd reaching your ears as you walk among some trees.","\n","^Io: You found my secret spot.","\n","^Zeus: Uh, hi. I didn't see you there.","\n","^Io: You're not supposed to. I'm watching the game from here because I want the other team to win.","\n",["ev","str","^\"Who are the teams\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: Who are the teams?","\n","^Io: The ZIGZAG U Eagles and the Cretan Bulls. And I want those bulls to bowl those eagles over.","\n",{"->":".^.^.^.^.unloyal"},{"#f":7}]}],["ev","str","^\"That's not very loyal\"","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":".^.^.^.^.unloyal"},{"#f":7}]}],null],{"unloyal":[["^Zeus: That's not very loyal. You've gotta support your own university team.","\n","^Io: But they're BULLS! They're so awesome.","\n","^Zeus: But you don't need to hide here. I'm sure no one would notice if you were in the stands.","\n","^Io: Well, I'm not just here because of that.","\n","^Zeus: No?","\n","^Io: This is where the mascot comes to take off his costume. Sometimes he lets me wear it. It's so hot.","\n","^Zeus: I'm sure it is, when someone's been wearing it for a whole game!","\n","^Io: Well I like it.","\n",["ev","str","^\"I'm not judging\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: I'm not judging. In fact, I think it's endearing.","\n","^Io: You do?","\n","^Zeus: Sure. You've got an interest and you're not ashamed to pursue it.","\n","^Io: Yeah, I suppose you're right.","\n",{"->":".^.^.^.^.^.io_likes"},{"#f":7}]}],["ev","str","^\"I like you\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: I like you.","\n","^Io: Well, you've got a funny way of showing it, buster.","\n","^Zeus: I'm just nervous. You make me feel like a bull in a china shop.","\n","^Io: What a cheap gag.","\n","^Zeus: Just let me take the bull by the horns and-","\n","^Io: Ugh!","\n","^Zeus: I'm not going to spin you a cock and bull story.","\n","^Io: You're relentless.","\n","^Zeus: And I'm not going to stop until I hit the bull's eye.","\n","^Io: How many more of these have you got?","\n","^Zeus: I've got plenty left in the bull pen.","\n","^Io: You know, you're kinda cute after all.","\n",{"->":".^.^.^.^.^.io_likes"},{"#f":7}]}],null],{"#f":3}],"io_likes":[["^Io: So, what are you doing here? The way to the bleachers is that way.","\n","^Zeus: Well, I'm not really here for the game. I came to see you.","\n","^Io: I know what that's like. I don't really like football, but I can't keep away from those bulls.","\n",["ev","str","^\"You're a bull to me\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: Well, in this case: you're a bull to me.","\n","^Io: Uh-huh...","\n","^Zeus: No! I mean-","\n","^Io: Relax, I know what you mean. I'm just playin' with ya.","\n","^Io: And for what it's worth, I'd let you be my bull.","\n","^Zeus: You would?","\n","^Io: Sure. You know, you've got the looks. Social skills could do with a scrub up. Although I guess it's kinda sweet. Yeah, I can see myself having a good time with you.","\n","^Zeus: Why don't we, then?","\n","^Io: N'aww, I can't pass up the opportunity to wear that bull costume. Sorry.","\n","^Zeus: Well, what about if we fool around here?","\n","^Io: Out in the open? No way!","\n","^Zeus: How about if we do it, but remain well hidden?","\n","^Io: Sure. But how?","\n",{"->":".^.^.^.^.^.io_flirty"},{"#f":7}]}],["ev","str","^\"I can't keep away from you\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: I can't keep away from you.","\n","^Io: You're really corny.","\n","^Zeus: I'm just nervous. Mouth-diarrhoea, you know?","\n","^Io: Here's a tip: talking about excrement isn't usually the best way into a woman's heart.","\n",{"->":".^.^.^.^.^.io_reject"},{"#f":7}]}],null],{"#f":3}],"io_flirty":[["^OK, so how will you remain hidden?","\n",["ev","str","^Dig a hole","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: I'll dig a hole, we climb in.","\n","^Io: Do you have a spade?","\n","^Zeus: No.","\n","^Io: Anyway to stop us getting muddy down there?","\n","^Zeus: Nope.","\n","^Io: Something to stop the mascot falling down to join us when he comes past here?","\n","^Zeus: Well, no.","\n","^Io: Let's put that idea in the 'maybe' pile.","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Climb a tree","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: We could climb one of these trees.","\n","^Io: 1. I have a terrible sense of balance, I do not want to be falling out of any trees.","\n","^Io: 2. There's hardly any leaves on these trees, they wouldn't keep us hidden from anyone.","\n","^Io: 3. It's just a really stupid suggestion.","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Shapeshift into Lightning","/str","/ev",{"*":".^.c","flg":20},{"c":["^ Fananganang! You're lightning.","\n","\n","^Io: Ah! What the? How? Whu? Huh?","\n","^Lightning: If I flash in front of everyone's eyes I could blind them all. Then no one would see us.","\n","^Io: Oh. That's not a bad idea, but have you got one that doesn't cause permanent damage to everyone?","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Shapeshift into Cloud","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: If I do this. Hghngh!","\n","^You floof into a cloud.","\n","^Cloud: I can surround you in my misty embrace, keeping you completely hidden from any prying eyes.","\n","^Io: Come on then. But how will you, you know...","\n","^Cloud: Oh, you'll see.","\n","^You surround Io. And now I can't see a thing. Ooh, was that a bit of- no, just my imagination.","\n","^Well, I suppose I'll leave you to it. Doo-dee-doo.","\n","^Make sure you remember all the details so you can tell me everything later.","\n","^Oh no. Psst. Zeus. Psss-ssst. Stop. Hera's coming.","\n",{"->":".^.^.^.^.^.hide_io"},{"#f":7}]}],null],{"#f":3}],"io_reject":[["^You hear someone running towards you from the field. It's the Bulls mascot removing the bulky horned head. He drops it by one of the trees where he takes off the rest of the costume. Then he runs for the building, holding his crotch.","\n","^Io: I love you!","\n","^Zeus: I don't think he can hear you.","\n","^Io: He's left me the costume! Squeeee!","\n","^Zeus: Nah, he's just gone to use the bathroom.","\n","^Io: Either way, now's my chance.","\n","^She grabs the costume in a feverish rush, pulling on the hoofed arms and legs.","\n","^Io: Ohh, it smells amazing!","\n","^She smiles at you as she lift the mask onto her head.","\n","^Io: Mmmmmm.","\n","^Io: Oh! Ooooooh!","\n","^Io: Mmmmmm huh. Huh. Oh.","\n","^Some students turn to look as they're walking by.","\n","^Well, this is a bit awkward. Maybe you should hide Io's wriggling and writhing from prying eyes.","\n","^But how? Surely one of your transformations could help out now.","\n",["ev","str","^Shapeshift into Lightning","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You clatter into the form of lightning.","\n","\n","^Lightning: I'll blind anyone that tries to sneaks a peek.","\n","^Io: What'd you say?","\n","^Lightning: Umm, nothing.","\n","^Io: Please don't hurt anyone.","\n","^Lightning: Fine.","\n","^You decide to see if being a cloud would be any better.","\n","^Cloud: Ah! I can surround you like this, and no one will see through my thick mist.","\n","^No sooner have you done this than Hera appears before you. Gulp.","\n",{"->":".^.^.^.^.^.hera_io"},{"#f":7}]}],["ev","str","^Shapeshift into Cloud","/str","/ev",{"*":".^.c","flg":20},{"c":["^You go all thick and fluffy.","\n","^Cloud: Ah! I can surround you like this, and no one will see through my thick mist.","\n","^No sooner have you done this than Hera appears before you. Gulp.","\n",{"->":".^.^.^.^.^.hera_io"},{"#f":7}]}],null],{"#f":3}],"hide_io":[["^What are you going to do now?","\n",["ev","str","^Shapeshift","/str","/ev",{"*":".^.c","flg":20},{"c":["^ Shapeshifting to any other form will reveal Io, and Hera will certainly not be happy about seeing that.","\n","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Look around","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You look around you. The mascot's costume is leaning against a tree right next to you.","\n","\n","^Cloud: Hey, Io.","\n","^Io: Yeah?","\n","^Cloud: Put the costume on.","\n","^Io: Wow. When did he leave that here? Man, if I've wasted a MINUTE where I could've been wearing that, I'll be so mad.","\n","^Cloud: Just put it on will you? Quickly!","\n","^Io: OK. You don't have to tell me twice.","\n","^Io scrambles into the bull costume. And just in time; no sooner has she pulled the head on, Hera appears before you.","\n",{"->":".^.^.^.^.^.hera_io"},{"#f":7}]}],null],{"#f":3}],"hera_io":[["^Hera: Zeus! What are you hiding in there?","\n","^Cloud: I-I'm not Zeus. I'm a fluffy cloud.","\n","^Hera: Zeus. I'm giving you 'til the count of three to become something with a face I can talk to. And probably slap if you're doing what I think you are. 1... 2...","\n","^Cloud: But I'm just-","\n","^You change into human form.","\n","^Zeus: playing hide and seek with my friends.","\n","^Hera: But it's just you and this cow.","\n","^Io: Bull, actually.","\n","^Hera: It's just you and this bull. I don't see anyone else playing hide and seek.","\n","^Zeus: That's because they're so well hidden. Look! Over there.","\n",["ev","str","^\"Found you, Philip!\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: Found you, Philip!","\n",{"->":".^.^.^.^.^.hera_io_cont"},{"#f":7}]}],["ev","str","^\"I can see you, Echo!\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: I can see you, Echo!","\n",{"->":".^.^.^.^.^.hera_io_cont"},{"#f":7}]}],["ev","str","^\"You'll have to do better than that, Jeremy!\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: You'll have to do better than that, Jeremy!","\n",{"->":".^.^.^.^.^.hera_io_cont"},{"#f":7}]}],null],{"#f":3}],"hera_io_cont":[["^Hera: Hmmm. You've not been having you-know-what with that bull have you?","\n","^Zeus: What? No! What do you think of me?","\n","^Hera: I think you've got an insatiable libido, and if I turn my back for one second, you'll find another poor waif to create more demi-gods with.","\n","^Zeus: No, Hera. I've only got eyes for you.","\n","^Hera: It's not your eyes I'm worried about.","\n","^Zeus: You can trust me, can't she bull?","\n","^Io: Mmmoooooo.","\n","^Hera: Well, OK. If you say so. But I've got many eyes watching you, Zeus Maxwell Jones. Don't make me regret signing you up for this university.","\n","^Zeus: I won't, dear.","\n","^Hera: That's good to hear. I'll see you later. But not much later, so don't get any ideas.","\n","^Zeus: No, snookums.","\n","^You blink and she's gone. She didn't even say 'bye'. Bit rude.","\n",["ev","str","^\"You can come out now, Io\"","/str","/ev",{"*":".^.c","flg":20},{"c":["^Zeus: It's OK. You can come out now, Io.","\n","^She doesn't seem to have heard.","\n","^Zeus: Hey that bull costume saved my bacon just then. I wonder if I could...","\n","^You shake out your hands and legs.","\n","^Zeus: Bar bar bar bar barbara ann.","\n","^NEW TRANSFORMATION ACQUIRED. You are now able to shapeshift into the form of a bull!","\n","^Bull: Hey Geppetto - I mean Io - I'm a real bull.","\n","^Bull: Would you consider an invitation to copulate with myself untoward?","\n","^Io: Mmmmm I'mmmmmm finnnnnnne innnnn herrrre thannnks.","\n","^Bull: But I'm an actual, real life bull!","\n","^Io: I'm in the middle of something here. Maybe another time, alright?","\n","^Bull: You don't know what you're missing. I'm a fine specimen from nose to tail.","\n","^Io: To be honest with you, I'm really more into the costume than real bulls. I don't think I could handle a real one.","\n","^Bull: That makes sense.","\n","^You changed back to human form.","\n","^Zeus: Well, good luck with everything.","\n","^Io: Mmmhmmmm.","\n","^You walk away and cruise on over to the swimming pool.","\n","end",{"#f":7}]}],null],{"#f":3}],"#f":3}],"#f":3}]}