{"inkVersion":11,"root":[{"->":"lab"},"done",{"lab":[["^BACKGROUND lab","\n","^CLEAR all","\n","^IMAGE left Zeus_normal","\n","^IMAGE right Semele_normal flip","\n","^The acrid smell of burning overwhelms you as you enter the science lab.","\n","^Semele stands with an electrode in each hand at one of the benches where you see a frog pinned helplessly beneath her. She jabs the frog with the electrodes and beams with glee as it convulses violently. She relaxes just long enough to savour the stench of scorched skin before jabbing the frog again, this time even more eager than before.","\n","^This is all very disturbing and also kind of hot.","\n",["ev","str","^Ahem","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"lab.flirt_with_semele"},{"#f":7}]}],["ev","str","^Dang gurl","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"lab.flirt_with_semele"},{"#f":7}]}],["ev","str","^Er... hello?","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"lab.flirt_with_semele"},{"#f":7}]}],["ev","str","^Go back to choose a place on campus","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"lab.on_earth"},{"#f":7}]}],["ev","str","^End it all","/str","/ev",{"*":".^.c","flg":20},{"c":["end",{"#f":7}]}],null],{"flirt_with_semele":[["^You startle her and she drops the electrodes. Clearly unimpressed, she eyes you with mixture of fascination and suspicion, like an Amish surprised by an ATM.","\n","^Semele: Fine, ruin my fun.","\n",["ev","str","^'Fun'?!?!","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"lab.semele_astonished_flirt"},{"#f":7}]}],["ev","str","^That poor frog!","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"lab.semele_judgy_flirt"},{"#f":7}]}],["ev","str","^No, by all means continue","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"lab.semele_approving_flirt"},{"#f":7}]}],["ev","str",{"f()":".^.s"},"/str","str","^I'll just leave you to it, then","/str","/ev",{"*":".^.c","flg":22},{"s":["^Umm... ",null],"c":[{"f()":".^.^.s"},"\n",{"->":"lab.leave_without_consummation"},{"#f":7}]}],null],{"#f":3}],"leave_without_consummation":[["^You decide to leave her to her frogtricity.","\n",{"->":"lab.on_earth"},null],{"#f":3}],"semele_astonished_flirt":[["^Zeus: This is what you do for fun?","\n","^Semele: Hey, I don't judge your hobbies!","\n","^Zeus: I'm not judging.","\n","^Semele: Hmm... (waits) No, you're not. Well, if you're not here to pillory me then why are you bothering me?","\n","^Zeus: Just curious, I guess. I mean, it doesn't look very scienc-ey does it?","\n","^Semele: Like I said, it's a hobby.","\n","^Zeus: Playing with dead animals?","\n","^Semele: It's not the animals I'm interested in, Mr Zeus.","\n","^Zeus: Well, why are you doing it then?","\n","^Semele: You really want to know?","\n","^Semele fixes you with a determined stare and without breaking her gaze picks up one of the electrodes from the bench. Without flinching she jabs it into her arm, causing the muscles and tendons to visibly twitch. She grins maniacally while still holding her gaze.","\n","^Zeus: Woah.","\n","^Semele: I don't mean to alarm you Mr Zeus, but you did ask.","\n","^Zeus: Hey, like I said before I'm not judging.","\n","^Semele: I don't expect you to understand.","\n","^Zeus: No, I totally get it!","\n","^Semele: You do?","\n","^Zeus: Yes!","\n","^Semele: The wonderful agony of having electricity surge through you?","\n","^Zues: Let's exchange notes.","\n","^You swiftly shapeshift into the form of a lightning bolt. Semele's eyes widen.","\n","^Semele: We are going to have so much sex right now.","\n","^Lightning: I know.","\n",{"->":"lab.semele_is_interested"},null],{"#f":3}],"semele_judgy_flirt":[["^Zeus: Wow you get off on torturing animals? That's some nineteenth century shit right there.","\n","^Semele: Oh save the screed, the frog's already dead. It's a specimen from the lab's storeroom. Seriously, what kind of a heel do you think I am? Besides...","\n","^She looks you up and down","\n","^Semele: ... you wouldn't begin know what gets me off.","\n","^Zeus: This is true. ... but I am very humble and willing to learn.","\n","^Semele: Why, Mr Zeus... I should turn these electrodes on you.","\n","^Zeus: Well, why don't you?","\n","^Semele: ... You're not even joking, are you?","\n","^Zeus: I only joke on Tuesdays, Miss Semele.","\n","^Semele: Is that so?","\n","^Zeus: No. That itself was a lie.","\n","^Semele: Well, for the record I keep my electrocutions to people who share my... eclectic tastes. And I don't think you qualify.","\n","^Zeus: You'd be surprised. Also, you could have said 'eclectric' just then and made a cracking pun of it.","\n","^Semele: Let's just put the puns behind us, shall we?","\n","^Zeus: Why? I like to keep up with current events.","\n","^Semele: Keep this up and I will electrocute you.","\n","^Zeus: Now we're talking.","\n","^Semele: You really think you're up to it, huh?","\n","^Zeus: Actually I think you're a bit of an amateur. Get ready for a SHOCKING revelation.","\n","^Semele: Ugh, I hope that's not another pun.","\n","^You do your shape-shift shimmy and assume the form of a lightning bolt.","\n","^Semele: Dammit.","\n",{"->":"lab.semele_is_interested"},null],{"#f":3}],"semele_approving_flirt":[["^Semele: What, you're going to sit here and watch me electrocute a frog?","\n","^Zeus: Sure, why not? My schedule's free.","\n","^Semele: I don't doubt that for a second.","\n","^Zeus: Hey, you're the one holed up in a science lab while everyone else is being all studenty and partying and stuff.","\n","^Semele: Well, off you go then.","\n","^ZUES: Nah. I think I like it more in here.","\n","^Semele: Suit yourself.","\n","^She returns to electrocuting the frog while keeping an occasional eye on you. For all the awkwardness she doesn't seem to be too put out by your presence.","\n","^Semele: Oh, dash it!","\n","^Zeus: What's up?","\n","^Semele: These electrodes are rubbish. No power!","\n","^Zeus: Ooh, I might be able to help you with that.","\n","^Semele: No dice Mr Mansplainey, I've tried fiddling with them but there's no way to increase the voltage.","\n","^Zeus: Well yes, but have you tried FIDDLING WITH THIS.","\n","^As you shapeshift into the form of a lightning bolt your clothes mysteriously disappear. You've never figured out how or why that happens but they come back when you revert so you've never really questioned it.","\n","^Semele: HOLY LIGHTNING COCK!","\n","^Lightning: Yeah, pretty much.","\n",{"->":"lab.semele_is_interested"},null],{"#f":3}],"semele_is_interested":[["^Semele: You just became a whole lot more interesting, and I already sort of had a thing for you.","\n","^Lightning: Good to know.","\n","^Semele pushes you hard onto the lab bench then jumps up and straddles you. She has some difficulty with this as you're a constantly shifting entity of energy with no discernible form, but she gets there in the end.","\n","^Semele: More voltage!","\n","^You slowly increase your power output and send your current coursing through her. She begins to convulse like the frog on the lab bench.","\n","^Semele: Yes... I have always dreamed about this.","\n","^Lightning: Really? I always get those ones where my teeth are falling out.","\n","^Semele: More voltage!","\n","^Again you increase your power and her convulsions grow more intense. This is an odd way to start the week.","\n","^Semele: More voltage!","\n","^You do as she says and increase your power output again.","\n","^Semele: Haha yes! My psychologist said I was a hopeless case who needed shock therapy. Well I'm gettin' it! You like that, Mr Hetherington? I'm getting what I need, and YOU'RE NOT GETTING ANYTHING YOU OVERQUALIFIED HACK! More voltage!!","\n","^As you increase the power further the room again begins to fill with the smell of burning skin. You think you can see smoke enemating from Semele's body, but it's hard to tell for sure because you're distracted by the amazing sex you're having.","\n","^Semele: More voltage!","\n","^You increase your power. You've never pushed this hard before!","\n","^Lightning: I can't give it any more, Semele! If I give it any more I'll blow!","\n","^Semele: Isn't that the idea?","\n","^Lightning: Oh, you're right. INCREASING POWER.","\n","^You increase your power. The lights in the room flicker and the computer by the window reboots.","\n","^Semele: Feel the power, see the energy coming up, COMING ON STRONG! MORE POWER! MORE POWER!","\n","^Semele is really hot! Like really, as in temperature hot. In fact, she's so hot that she glows bright red and bursts into flame.","\n","^Semele: Oh, shitting cock.","\n","^The fire engulfs her completely and she explodes into a (hot) mess. Before you can respond to what's happened all that remains of her is an ashy cloud hovering above you. You sheepishly re-assume your human form (though not as sheepishly, it must be said, as you would if assuming the form of a sheep).","\n","^IMAGE middle Zeus_normal flip","\n","^IMAGE left Semele_cloud","\n","^Zeus: Ooooh... sorry about that.","\n","^Semele: Don't apologize! That was COMPLETELY amazing.","\n","^Zeus: But you're a cloud! And that explosion can't have tickled.","\n","^Semele: Well, you're not wrong there. But I think I'm okay with this whole cloud thing.","\n","^Zeus: Really?","\n","^Semele: Yeah! I can float around wherever I want. The wind is tickling me in bits I didn't even know I had. Wait... I guess until now I DIDN'T have them. But that's what makes it exciting! Besides, I can see my house from up here.","\n","^Zeus: You're taking this awfully well.","\n","^Semele: Well, you GAVE it awfully well.","\n","^Zeus: So you're not unhappy with me?","\n","^Semele: Nah. I'm completely on board with being a cloud. I'm going to spend my time up in the heavens chasing thunderstorms. Can you imagine the kick one of those would give you from up here? I think this is my calling.","\n","^Zeus: Err, right.","\n","^Semele: Don't knock it until you've tried it, voltage boy. This is a blast and a half.","\n","^CLEAR right","\n","^And with that she drifts off into the breeze like an atypically aerodynamic elephant.","\n","^Cloud, eh? That's not something you'd considered before but she sure gave it a solid endorsement. You wonder if your Goddy shape-shifting powers would stretch far enough to allow you to become a cloud yourself? You guess there's one way to find out.","\n","^Zeus: Nnnnngh. *cough*","\n","^You adopt your best shapeshifting pose and clench like you've never clenched before.","\n","^Zeus: Zig-a-zig, Aah!","\n","^NEW TRANSFORMATION ACQUIRED. You are now able to shape-shift into the form of a cloud!","\n","^Cloud: Hey, that DOES tickle. I'd better revert to my human form before I become overstimulated.","\n","^Zeus: Ah, that's better. The reassuring familiarity of dangling flesh.","\n","^Hera: ZEUS!!","\n","^Zeus: Ah, crap.","\n","^FLIP middle","\n","^Your wife Hera wisps in through the window and assumes her human form. You wish she'd just use the door like everyone else.","\n","^IMAGE right Hera_normal flip","\n","^Hera: What are you doing here?","\n","^Zeus: Just repeatedly electrocuting this dead frog! Nothing eccentric or unusual.","\n","^She gives you more side-eye than a black moor convention.","\n","^Hera: Why did the power go out just now?","\n","^Zeus: Erm.. these electrodes! They must have overloaded the grid.","\n","^Hera: *sniff* What's all this ashy smoke, then?","\n","^Zeus: I was also vaping?","\n","^Hera: Vaping?","\n","^Zeus: Yes! Vaping.","\n","^Hera: So you've been here all day, electrocuting frogs and vaping.","\n","^Zeus: That's me! Ol' frog zappin' vapin' Zeus.","\n","^Hera: And why does it smell like sex in here?","\n","^Zeus: Sex?","\n","^Hera: Yes. It smells like someone just had sex in here.","\n","^Zeus: That must be the frog! They often smell like sex. That's why people lick them as aphrodisiacs.","\n","^Hera: I thought that was toads.","\n","^Zeus: They're basically the same.","\n","^Hera: Toads are a completely different genus.","\n","^Zeus: Yes, well OBVIOUSLY they're a different genus but physically they're basically the same.","\n","^Hera: You don't say.","\n","^Zeus: Well, I just did.","\n","^Hera: I see.","\n","^Hera: You wouldn't be CHEATING on me, now would you Zeus?","\n","^Zeus: CHEATING? Hera, darling, love of my life! Whatever makes you think I would ever be unfaithful?","\n","^Hera: The unending procession of affairs you've embarked upon for the entirety of our marriage.","\n","^Zeus: Yes well there's those, but I'm a changed man! New Zeus doesn't cheat on ANYONE or ANYTHING, with the exception of Space Alert and my taxes. I'll prove it to you! Let's have some hot sex right now.","\n","^Hera: Can't. I'm off to the winery with Cydippe and I'm already late.","\n","^Zeus: Well, don't let me hold you up, my one and only true love.","\n","^Hera: Hmph.","\n",["ev","str","^Go back to choose a place on campus","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"lab.on_earth"},{"#f":7}]}],["ev","str","^End it all","/str","/ev",{"*":".^.c","flg":20},{"c":["end",{"#f":7}]}],null],{"#f":3}],"on_earth":[["^This actually links up to the next bit of story","\n","done",null],{"#f":3}],"#f":3}],"#f":3}]}