{"inkVersion":11,"root":[{"->":"europa"},"done",{"europa":[{"->":".^.poolside"},{"poolside":[["^BACKGROUND pool","\n","^There's one person swimming in the pool. Long strokes making her glide easily through the water. She stops and treads water when she sees you approach.","\n","^Europa: Hey there, handsome. Taken up my offer, have you?","\n","^Zeus: Yeah, I thought you could do with some company in there.","\n","^Europa: Come on in.","\n","^Zeus: I - ah, haven't got my swimming costume.","\n","^Europa: Don't worry about that. Get naked. You haven't got anything I haven't seen before.","\n","^You strip off, even though your clothes are only manifest because you've chosen to be in human form. Yet, they still remain on the floor when you remove them. Look, it's a bit complicated. All you need to know is that you've just stripped off beside the pool.","\n","^Europa: Impressive.","\n","^Zeus: You think that's impressive? Get an eyeful of this.","\n",{"->":"europa.impressing"},null],{"#f":3}],"impressing":[["^How will you impress Europa?","\n",["ev","str","^Shapeshift into Lightning","/str","/ev",{"*":".^.c","flg":20},{"c":["^ Shazam! You throb with electric power.","\n","\n","^Europa: What do you think you're doing? Trying to kill me?!","\n","^Lightning: I just thought-","\n","^Europa: No, you didn't think. Water and lightning and human bodies don't go together well. The results can be rather lethal.","\n","^Lightning: Right, right. I'll try to remember that.","\n","^You return to human form.","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Shapeshift into Cloud","/str","/ev",{"*":".^.c","flg":20},{"c":["^ Flimp! You're a cloud. You float over the pool and mingle with the steam rising off the water.","\n","\n","^Cloud: Teeheehee!","\n","^Europa: What's so funny?","\n","^Cloud: It's just so tickly.","\n","^Europa: I guess that is pretty impressive. What else can you do?","\n","^You glide back over to the poolside and return to human form.","\n","^Zeus: Let me think...","\n",{"->":".^.^.^.^"},{"#f":7}]}],["ev","str","^Shapeshift into Bull","/str","/ev",{"*":".^.c","flg":20},{"c":["^ Heffalump! You morph into a bull.","\n","\n","^Bull: How does this transmogrification suit your desires?","\n","^Europa: Woah! You're so muscular, so... so beefy!","\n","^Bull: I am delighted to have met with your approval.","\n","^Europa: Can I ride you?","\n","^Bull: I see no reason to refuse. Hop on.","\n","^She clambers out of the pool and up onto your back, dripping water down your flanks. Europa grips onto your horns and squeezes with her strong legs.","\n","^Europa: Yah! Mush! Giddy up!","\n","^You leap forward at a pace, picking up speed as you turn the corner by the pool.","\n","^Europa: This is so much better than a bucking bronco.","\n","^You kick your back legs out as you rush down the length of the pool and into the next corner. Europa's being flung from side to side, but her grip still holds.","\n","^Europa: That's it, baby. Buck me! Buck me!","\n","^You pass a sign reading: No running.","\n","^Europa: Ignore that sign.","\n","^You see another sign as you turn the corner: No horseplay.","\n","^Europa: And that one.","\n","^You charge along the pool edge. Your hoof slides from under you as you rush over some standing water. Losing control, you fall into the pool, a cascade of water rising into the air as your heft displaces the water.","\n","^Europa surfaces nearby and hugs close to you when the droplets fall back into the pool.","\n","^Europa: Eeeee!","\n","^You bob together as the liquid settles.","\n","^Europa: Thank you. I, err... needed that.","\n","^She kisses you on the nose. You feel somewhat dizzy. Stars spin in your eyes.","\n","^Europa: Change back into a human and I'll make it worth your while.","\n",{"->":"europa.light_get"},{"#f":7}]}],["ev","str","^Thrust your hips forward","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You thrust your hips forward.","\n","\n","^Zeus: Huzzah!","\n","^When the motion's stopped you look at Europa.","\n","^Europa: Yyyyyeah... Not quite so impressive anymore.","\n","^You'll have to do something to get her back onside.","\n",{"->":".^.^.^.^"},{"#f":7}]}],null],{"#f":3}],"light_get":[[["ev","str","^Shapeshift into Human","/str","/ev",{"*":".^.c","flg":20},{"c":["^ You shut your eyes to concentrate on your transformation but all you can see is stars.","\n","\n","^Twinkle twinkle! Well something's happened. You've changed form.","\n","^You open your eyes and look at yourself. You see a glimmering mass of lights.","\n","^NEW TRANSFORMATION ACQUIRED. You are now able to shapeshift into the form of a light!","\n","^Light: That was unexpected.","\n","^Europa: Is that what you normally look like? A non-corporeal shower of light?","\n","^Light: No. I didn't mean to become this. It's quite cool though. I'm nimble, I'm bright, I'm golden.","\n","^Europa: I look for other qualities in my men. Substantiality between pretty high on the list.","\n","^You go to touch Europa's arm but find yourself flying across campus at the speed of light.","\n","^BACKGROUND clockTowerOutside","\n","^Light: Woah! I better learn how to control myself like this. I'll become human again before I hurt somebody.","\n","^You transform back into your human appearance. And yes, you're wearing clothes again. I told you, it's complicated.","\n","^You look around and find you're outside a tall clock tower. Didn't you hear Ganymede saying something about someone being inside?","\n","end",{"#f":7}]}],null],{"#f":3}],"#f":3}],"#f":3}]}